wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_esc.c
/*!
    \file    gd32h77x_esc.c
    \brief   ESC driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_esc.h"
#include <string.h>

#define ESC_ADDR_MASK           (uint16_t)0x0FFFU
#define ESC_TIMEOUT_CNT_MASK    (uint32_t)0x000001FFU

#define ESC_DELAY               ((uint32_t)0x01FFFFFFU)     /* Timeout for ESC operations */

/*!
    \brief      pdi direct access read esc register (API_ID(0x0001U))
    \param[in]  readbuffer: data read buffer
    \param[in]  addr: esc register address offset
    \param[in]  count: the number to read from esc register
    \param[out] none
    \retval     none
*/
void pdi_direct_read_reg(uint8_t readbuffer[], uint16_t addr, uint16_t count)
{
    uint16_t address = (addr & ESC_ADDR_MASK);
    uint16_t i;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(readbuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0001U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(count) {
        case 0x1U:
            *(uint8_t *)readbuffer = REG8(ESC_BASE + address);
            break;
        case 0x2U:
            *(uint16_t *)readbuffer = REG16(ESC_BASE + address);
            break;
        case 0x4U:
            *(uint32_t *)readbuffer = REG32(ESC_BASE + address);
            break;
        default:
            for(i = 0U; i < count; i++) {
                readbuffer[i] = REG8(ESC_BASE + address + i);
            }
            break;
        }
    }
}

/*!
    \brief      pdi indirect access read esc register (API_ID(0x0002U))
    \param[in]  readbuffer: data read buffer
    \param[in]  addr: esc register address offset
    \param[in]  count: the number to read from esc register
    \param[out] none
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pdi_indirect_read_reg(uint8_t readbuffer[], uint16_t addr, uint16_t count)
{
    uint32_val param32_1 = {0U};
    uint8_t i = 1U;
    uint16_t address = (uint16_t)(addr & ESC_ADDR_MASK);
    uint32_t timeout;
    uint16_t buffer_index = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(readbuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* loop for all bytes to be read */
        while(count > 0U) {
            /* reset/abort any previous commands */
            param32_1.val = CCTL_STOP;
            ESC_CCTL_CMD = param32_1.val;

            /* wait with timeout */
            timeout = ESC_DELAY;
            do {
                param32_1.val = ESC_CCTL_CMD;
                timeout--;
            } while((0U != timeout) && (param32_1.val & CCTL_BUSY));

            param32_1.val = MAKE_UINT32_FROM_BYTES(GET_LOW_BYTE(address), GET_HIGH_BYTE(address), i, ESC_READ_BYTE);

            ESC_CCTL_CMD = param32_1.val;

            /* wait with timeout */
            timeout = ESC_DELAY;
            do {
                param32_1.val = ESC_CCTL_CMD;
                timeout--;
            } while((0U != timeout) && (param32_1.val & CCTL_BUSY));

            param32_1.val = ESC_CCTL_DATA;

            switch(address & (uint16_t)0x0003U) {
            case 0x0000U:
                readbuffer[buffer_index] = GET_BYTE0(param32_1.val);
                break;
            case 0x0001U:
                readbuffer[buffer_index] = GET_BYTE1(param32_1.val);
                break;
            case 0x0002U:
                readbuffer[buffer_index] = GET_BYTE2(param32_1.val);
                break;
            case 0x0003U:
                readbuffer[buffer_index] = GET_BYTE3(param32_1.val);
                break;
            default:
                /* this should not occur under normal conditions */
                break;
            }

            count -= i;
            buffer_index += i;
            address += i;
        }
    }
}

/*!
    \brief      pdi direct access write esc register (API_ID(0x0003U))
    \param[in]  writebuffer: data write buffer
    \param[in]  addr: esc register address offset
    \param[in]  count: the number to write to esc register
    \param[out] none
    \retval     none
*/
void pdi_direct_write_reg(uint8_t writebuffer[], uint16_t addr, uint16_t count)
{
    uint16_t address = (addr & ESC_ADDR_MASK);
    uint16_t i;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(writebuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(count) {
        case 0x0001U:
            REG8(ESC_BASE + address) = *(uint8_t *)writebuffer;
            break;
        case 0x0002U:
            REG16(ESC_BASE + address) = *(uint16_t *)writebuffer;
            break;
        case 0x0004U:
            REG32(ESC_BASE + address) = *(uint32_t *)writebuffer;
            break;
        default:
            for(i = 0U; i < count; i++) {
                REG8(ESC_BASE + address + i) = writebuffer[i];
            }
            break;
        }
    }
}

/*!
    \brief      pdi indirect access write esc register (API_ID(0x0004U))
    \param[in]  writebuffer: data write buffer
    \param[in]  addr: esc register address offset
    \param[in]  count: the number to write to esc register
    \param[out] none
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pdi_indirect_write_reg(uint8_t writebuffer[], uint16_t addr, uint16_t count)
{
    uint32_val param32_1 = {0U};
    uint8_t i = 1U;
    uint16_t address = (uint16_t)(addr & ESC_ADDR_MASK);
    uint32_t timeout;
    uint16_t buffer_index = 0U;

