wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_esc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(writebuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        while(count > 0U) {
            /* reset/abort any previous commands */
            param32_1.val = CCTL_STOP;
            ESC_CCTL_CMD = param32_1.val;

            /* wait with timeout */
            timeout = ESC_DELAY;
            do {
                param32_1.val = ESC_CCTL_CMD;
                timeout--;
            } while((0U != timeout) && (param32_1.val & CCTL_BUSY));

            param32_1.val = 0U;
            switch(address & (uint16_t)0x0003U) {
            case 0x0000U:
                param32_1.val = SET_BYTE0(param32_1.val, writebuffer[buffer_index]);
                break;
            case 0x0001U:
                param32_1.val = SET_BYTE1(param32_1.val, writebuffer[buffer_index]);
                break;
            case 0x0002U:
                param32_1.val = SET_BYTE2(param32_1.val, writebuffer[buffer_index]);
                break;
            case 0x0003U:
                param32_1.val = SET_BYTE3(param32_1.val, writebuffer[buffer_index]);
                break;
            default:
                /* this should not occur under normal conditions */
                break;
            }

            ESC_CCTL_DATA = param32_1.val;

            param32_1.val = MAKE_UINT32_FROM_BYTES(GET_LOW_BYTE(address), GET_HIGH_BYTE(address), i, ESC_WRITE_BYTE);

            ESC_CCTL_CMD = param32_1.val;

            /* wait with timeout */
            timeout = ESC_DELAY;
            do {
                param32_1.val = ESC_CCTL_CMD;
                timeout--;
            } while((0U != timeout) && (param32_1.val & CCTL_BUSY));

            count -= i;
            buffer_index += i;
            address += i;
        }
    }
}

/*!
    \brief      pdi direct access read esc pdram (API_ID(0x0005U))
    \param[in]  readbuffer: data read buffer
    \param[in]  addr: esc pdram address offset
    \param[in]  count: the number to read from esc pdram
    \param[out] none
    \retval     none
*/
void pdi_direct_read_pdram(uint8_t readbuffer[], uint16_t addr, uint16_t count)
{
    uint32_t address = (uint32_t)addr;
    uint16_t i;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(readbuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* read data byte by byte using register access macros to avoid type conversion */
        for(i = 0U; i < count; i++) {
            readbuffer[i] = REG8(ESC_BASE + address + (uint32_t)i);
        }
    }
}

/*!
    \brief      pdi indirect access read esc pdram (API_ID(0x0006U))
    \param[in]  readbuffer: data read buffer
    \param[in]  addr: esc pdram address offset
    \param[in]  count: the number to read from esc pdram
    \param[out] none
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pdi_indirect_read_pdram(uint8_t readbuffer[], uint16_t addr, uint16_t count)
{
    uint32_val param32_1 = {0U};
    uint16_t i = 0U, length, byteposition;
    uint16_t address = (uint16_t)addr;
    uint32_t timeout;
    uint8_t temp_bytes[4];

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(readbuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset/abort any previous commands */
        param32_1.val = PRAM_STOP_READ;

        ESC_PRAM_CR = param32_1.val;
        /* the host should not modify this field unless the pdram read busy bit is 0 */
        timeout = ESC_DELAY;
        do {
            param32_1.val = ESC_PRAM_CR;
            timeout--;
        } while((0U != timeout) && (param32_1.val & PRAM_BUSY_READ));

        /* write address and length in the esc pdram read address and length register */
        param32_1.val = MAKE_UINT32_FROM_WORDS(address, count);
        ESC_PRAM_ALR = param32_1.val;

        /* set pdram read busy bit to start read operation */
        ESC_PRAM_CR = PRAM_BUSY_READ;
        timeout = ESC_DELAY;
        do {
            param32_1.val = ESC_PRAM_CR;
            timeout--;
        } while((0U != timeout) && (param32_1.val & PRAM_BUSY_READ));

        /* get the length for first read */
        param32_1.val = ESC_PRAM_FIFO_DR;
        byteposition = (address & (uint16_t)0x0003U);
        length = ((uint16_t)4U - byteposition) > count ? count : ((uint16_t)4U - byteposition);

        /* extract bytes using macros */
        temp_bytes[0] = GET_BYTE0(param32_1.val);
        temp_bytes[1] = GET_BYTE1(param32_1.val);
        temp_bytes[2] = GET_BYTE2(param32_1.val);
        temp_bytes[3] = GET_BYTE3(param32_1.val);

        memcpy(&readbuffer[i], &temp_bytes[byteposition], (size_t)length);
        count -= length;
        i += length;

        while(count) {
            param32_1.val = ESC_PRAM_FIFO_DR;
            length = count > (uint16_t)4U ? (uint16_t)4U : count;

            /* extract bytes using macros */
            temp_bytes[0] = GET_BYTE0(param32_1.val);
            temp_bytes[1] = GET_BYTE1(param32_1.val);
            temp_bytes[2] = GET_BYTE2(param32_1.val);
            temp_bytes[3] = GET_BYTE3(param32_1.val);

            memcpy(&readbuffer[i], temp_bytes, (size_t)length);
            i += length;
            count -= length;
        }
    }
}

/*!
    \brief      pdi direct access write esc pdram (API_ID(0x0007U))
    \param[in]  writebuffer: data write buffer
    \param[in]  addr: esc pdram address offset
    \param[in]  count: the number to write to esc pdram
    \param[out] none
    \retval     none
*/
void pdi_direct_write_pdram(uint8_t writebuffer[], uint16_t addr, uint16_t count)
{
    uint32_t address = (uint32_t)addr;
    uint16_t i;

