wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_esc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(writebuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* write data byte by byte using register access macros to avoid type conversion */
        for(i = 0U; i < count; i++) {
            REG8(ESC_BASE + address + (uint32_t)i) = writebuffer[i];
        }
    }
}

/*!
    \brief      pdi indirect access write esc pdram (API_ID(0x0008U))
    \param[in]  writebuffer: data write buffer
    \param[in]  addr: esc pdram address offset
    \param[in]  count: the number to write to esc pdram
    \param[out] none
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pdi_indirect_write_pdram(uint8_t writebuffer[], uint16_t addr, uint16_t count)
{
    uint32_val param32_1 = {0U};
    uint16_t i = 0U, length, byteposition;
    uint16_t address = (uint16_t)addr;
    uint32_t timeout;
    uint8_t temp_bytes[4];

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(writebuffer)) {
        fw_debug_report_err(ESC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset or abort any previous commands */
        param32_1.val = PRAM_STOP_WRITE;

        ESC_PRAM_CW = param32_1.val;
        /* make sure there is no previous write is pending bit is a 0 */
        timeout = ESC_DELAY;
        do {
            param32_1.val = ESC_PRAM_CW;
            timeout--;
        } while((0U != timeout) && (param32_1.val & PRAM_BUSY_WRITE));

        /* write address and length register with the starting address and length */
        param32_1.val = MAKE_UINT32_FROM_WORDS(address, count);
        ESC_PRAM_ALW = param32_1.val;
        param32_1.val = PRAM_BUSY_WRITE;
        ESC_PRAM_CW = param32_1.val;

        /* get the byte length for first write */
        byteposition = (address & (uint16_t)0x0003U);
        length = ((uint16_t)4U - byteposition) > count ? count : ((uint16_t)4U - byteposition);

        /* clear temp bytes and copy data */
        temp_bytes[0] = 0U;
        temp_bytes[1] = 0U;
        temp_bytes[2] = 0U;
        temp_bytes[3] = 0U;
        memcpy(&temp_bytes[byteposition], &writebuffer[i], (size_t)length);
        /* create uint32 from bytes using macro */
        param32_1.val = MAKE_UINT32_FROM_BYTES(temp_bytes[0], temp_bytes[1], temp_bytes[2], temp_bytes[3]);
        ESC_PRAM_FIFO_DW = param32_1.val;
        count -= length;
        i += length;

        while(count) {
            length = count > 4U ? 4U : count;
            /* clear temp bytes and copy data */
            temp_bytes[0] = 0U;
            temp_bytes[1] = 0U;
            temp_bytes[2] = 0U;
            temp_bytes[3] = 0U;
            memcpy(temp_bytes, &writebuffer[i], (size_t)length);
            /* create uint32 from bytes using macro */
            param32_1.val = MAKE_UINT32_FROM_BYTES(temp_bytes[0], temp_bytes[1], temp_bytes[2], temp_bytes[3]);
            ESC_PRAM_FIFO_DW = param32_1.val;
            i += length;
            count -= length;
        }
    }
}

/*!
    \brief      esc pdi reset (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pdi_reset(void)
{
    uint8_t wbuffer[1] = {0U};
    wbuffer[0] = PDI_RESET_R; /* R */
    pdi_direct_write_reg(wbuffer, ESC_RST_PDI_OFFSET, 0x0001U);
    wbuffer[0] = PDI_RESET_E; /* E */
    pdi_direct_write_reg(wbuffer, ESC_RST_PDI_OFFSET, 0x0001U);
    wbuffer[0] = PDI_RESET_S; /* S */
    pdi_direct_write_reg(wbuffer, ESC_RST_PDI_OFFSET, 0x0001U);
}

/*!
    \brief      PDI read phy (API_ID(0x000AU))
    \param[in]  phy_addr: phy address
    \param[in]  phy_reg_addr: phy register address
    \retval     res: 16-bit PHY register data read from the specified address
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
uint16_t pdi_phy_read(uint8_t phy_addr, uint8_t phy_reg_addr)
{
    uint8_t temp        = 0U;
    uint8_t value       = 0U;
    uint8_t readbuf[2]  = {0U};
    uint16_t res        = 0U;
    uint32_t timeout;

    /* PDI access MDIO allowed */
    temp = PDI_ACCESS_MII_MANAGEMENT_ENABLE;
    pdi_direct_write_reg(&temp, MIIM_PDI_ACC_STAT_OFFSET, 0x0001U);

    /*1. check mdio idle state */
    timeout = ESC_DELAY;
    do {
        pdi_direct_read_reg(&temp, ESC_MII_MNG_STAT_OFFSET, 0x0001U);
        timeout--;
    } while((0U != timeout) && (temp & 0x80U));

    /*2. write PHY address and PHY register */
    value = phy_addr ;
    pdi_direct_write_reg(&value, ESC_PHY_ADDR_OFFSET, 0x0001U);
    value = phy_reg_addr ;
    pdi_direct_write_reg(&value, ESC_PHY_REG_ADDR_OFFSET, 0x0001U);

    /* 3. write PHY command */
    value = READ_PHY_CMD;
    pdi_direct_write_reg(&value, ESC_MII_MNG_STAT_OFFSET, 0x0001U);

    /* 4. wait for mdio idle and get data */
    timeout = ESC_DELAY;
    do {
        pdi_direct_read_reg(&temp, ESC_MII_MNG_STAT_OFFSET, 0x0001U);
        timeout--;
    } while((0U != timeout) && (temp & 0x80U));

    /* 5. check mdio idle state */
    pdi_direct_read_reg(readbuf, ESC_PHY_DATA_OFFSET, 0x0002U);

    res = (uint16_t)((((uint32_t)readbuf[1]) << 8U) | (readbuf[0]));
    return res;
}

/*!
    \brief      PDI write phy (API_ID(0x000BU))
    \param[in]  phy_addr: phy address
    \param[in]  phy_reg_addr: phy register address
    \param[in]  phy_data: phy data
    \retval     none
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
void pdi_phy_write(uint8_t phy_addr, uint8_t phy_reg_addr, uint16_t phy_data)
{
    uint8_t temp         = 0U;
    uint8_t value        = 0U;
    uint8_t writebuf[2]  = {0U};
    uint32_t timeout;

    writebuf[0] = (uint8_t)phy_data;
    writebuf[1] = (uint8_t)(phy_data >> 8U);

    /* PDI access MDIO allowed */
    temp = PDI_ACCESS_MII_MANAGEMENT_ENABLE;
    pdi_direct_write_reg(&temp, MIIM_PDI_ACC_STAT_OFFSET, 0x0001U);


    /* 1. check mdio idle state */
    timeout = ESC_DELAY;
    do {
        pdi_direct_read_reg(&temp, ESC_MII_MNG_STAT_OFFSET, 0x0001U);
        timeout--;
    } while((0U != timeout) && (temp & 0x80U));

    /* 2. write PHY address and PHY register */
    value = phy_addr;
    pdi_direct_write_reg(&value, ESC_PHY_ADDR_OFFSET, 0x0001U);
    value = phy_reg_addr;
    pdi_direct_write_reg(&value, ESC_PHY_REG_ADDR_OFFSET, 0x0001U);

    /* 3. write PHY data */
    pdi_direct_write_reg(writebuf, ESC_PHY_DATA_OFFSET, 0x0002U);

