wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_esc.c
    /* 4. write PHY command and enable */
    value = WRITE_PHY_ENABLE;
    pdi_direct_write_reg(&value, ESC_MII_MNG_CTL_OFFSET, 0x0001U);
    value = WRITE_PHY_CMD;
    pdi_direct_write_reg(&value, ESC_MII_MNG_STAT_OFFSET, 0x0001U);

    /* 5. wait for mdio idle */
    timeout = ESC_DELAY;
    do {
        pdi_direct_read_reg(&temp, ESC_MII_MNG_STAT_OFFSET, 0x0001U);
        timeout--;
    } while((0U != timeout) && (temp & 0x80U));
}

/*!
    \brief      ESC brp enable (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void esc_brp_enable(void)
{
    ESC_CTL |= BRP;
}

/*!
    \brief      ESC brp disable (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void esc_brp_disable(void)
{
    ESC_CTL &= ~BRP;
}

/*!
    \brief      ESC timeout enable (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void esc_timeout_enable(void)
{
    ESC_CTL |= TOEN;
}

/*!
    \brief      ESC timeout disable (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void esc_timeout_disable(void)
{
    ESC_CTL &= ~TOEN;
}

/*!
    \brief      ESC timeout counter (API_ID(0x0010U))
    \param[in]  cnt:0-511
    \param[out] none
    \retval     none
*/
void esc_timeout_cnt(uint32_t cnt)
{
    ESC_CTL &= ~(TO_CNT);
    ESC_CTL |= ESC_TO_CNT(cnt & ESC_TIMEOUT_CNT_MASK);
}

/*!
    \brief      enable the on_chip_bus interrupt (API_ID(0x0011U))
    \param[in]  int_flag: refer to esc_on_chip_bus_interrupt_enum
                  only one parameter can be selected which is shown as below:
      \arg        ESC_I2CIE: Internal I2C overrun interrupt enable
      \arg        ESC_CCTLIVIE: CCTL size & addr illegal value interrupt enable
      \arg        ESC_WEIE: write error interrupt enable
      \arg        ESC_TOIE: time out interrupt enable
      \arg        ESC_WDLIE: write data lost interrupt enable
    \param[out] none
    \retval     none
*/
void esc_interrupt_enable(esc_on_chip_bus_interrupt_enum interrupt)
{
    ESC_REG_VAL(interrupt) |= BIT(ESC_BIT_POS(interrupt));
}

/*!
    \brief      disable the on_chip_bus interrupt (API_ID(0x0012U))
    \param[in]  int_flag: refer to esc_on_chip_bus_interrupt_enum
                  only one parameter can be selected which is shown as below:
      \arg        ESC_I2CIE: Internal I2C overrun interrupt enable
      \arg        ESC_CCTLIVIE: CCTL size & addr illegal value interrupt enable
      \arg        ESC_WEIE: write error interrupt enable
      \arg        ESC_TOIE: time out interrupt enable
      \arg        ESC_WDLIE: write data lost interrupt enable
    \param[out] none
    \retval     none
*/
void esc_interrupt_disable(esc_on_chip_bus_interrupt_enum interrupt)
{
    ESC_REG_VAL(interrupt) &= ~BIT(ESC_BIT_POS(interrupt));
}

/*!
    \brief      get esc on_chip_bus flag (API_ID(0x0013U))
    \param[in]  int_flag: refer to esc_on_chip_bus_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        ESC_FLAG_I2CF: Internal I2C communication error flag
      \arg        ESC_FLAG_CCTLIVF: CCTL size & addr illegal value flag
      \arg        ESC_FLAG_WEF: write error flag
      \arg        ESC_FLAG_TOF: time out flag
      \arg        ESC_FLAG_WDLF: write data lost flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus esc_interrupt_flag_get(esc_on_chip_bus_flag_enum int_flag)
{
    FlagStatus reval = RESET;

    /* get the ESC on_chip_bus interrupt flag */
    if(RESET != (ESC_REG_VAL(int_flag) & BIT(ESC_BIT_POS(int_flag)))) {
        reval = SET;
    }
    return reval;
}

/*!
    \brief      clear esc on_chip_bus flag (API_ID(0x0014U))
    \param[in]  int_flag: refer to esc_on_chip_bus_flag_enum
                  only one parameter can be selected which is shown as below:
      \arg        ESC_FLAG_I2CF: Internal I2C communication error flag
      \arg        ESC_FLAG_CCTLIVF: CCTL size & addr illegal value flag
      \arg        ESC_FLAG_WEF: write error flag
      \arg        ESC_FLAG_TOF: time out flag
      \arg        ESC_FLAG_WDLF: write data lost flag
    \param[out] none
    \retval     none
*/
void esc_interrupt_flag_clear(esc_on_chip_bus_flag_enum int_flag)
{
    ESC_REG_VAL(int_flag) |= BIT(ESC_BIT_POS(int_flag));
}
